pipeFlowReg/case5_Steady_rad_sir1/constant/zonetwo/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

".*"
{
    type            lookup;
    emissivity      1.0;
    absorptivity    1.0;
    transmissivity  0.0;
    nWeights        1;
}


/*
".*"
{
    type            lookup;
    emissivity      1.0;
    absorptivity    0.1;
    transmissivity  0.0;
    nWeights        1;
 //   weights         1;
   // nBands          1;
} */

/*frontandBack
{
    type            empty;
}


// ************************************************************************* //
