pipeFlowReg/case5_Steady_rad_sir1/constant/zonetwo/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/zonetwo/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    zonetwo_to_zoneone
    {
        type            mappedPatch;
        inGroups        1(mappedPatch);
        nFaces          25;
        startFace       14675;
        sampleMode      nearestPatchFace;
        sampleRegion    zoneone;
        samplePatch     zoneone_to_zonetwo;
        sampleDatabase  true;
    }
    outlet
    {
        type            patch;
        nFaces          25;
        startFace       14700;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       14725;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       15025;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          7500;
        startFace       15025;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          7500;
        startFace       22525;
    }
)

// ************************************************************************* //
